In [1]:
import pandas as pd
import numpy as np

stuff = {
    "Corporation": ["Apple", "Google", "Meta", "Apple", "Google", "Meta"],
    "Employees": ["John", "April", "Wes", "Beth", "Justin", "Steph"],
    "Salary": [200, 220, 190, 130, 120, 150],
}
my_table = pd.DataFrame(stuff)
my_table

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [2]:
# Create Function
def timesThousand(x):
    return x * 1000

In [3]:
# Use Apply
my_table['Salary'].apply(timesThousand)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [4]:
# Make into a DataFrame
pd.DataFrame(my_table["Salary"].apply(timesThousand))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000

In [5]:
# Add Elder Last Name
def namer(x):
    return f"{x} Elder"

In [6]:
# Show Elder Names
my_table["Employees"].apply(namer)

0      John Elder
1     April Elder
2       Wes Elder
3      Beth Elder
4    Justin Elder
5     Steph Elder
Name: Employees, dtype: object

In [7]:
# Using Lambda
my_table["Employees"].apply(lambda x: f"{x} Junior")

0      John Junior
1     April Junior
2       Wes Junior
3      Beth Junior
4    Justin Junior
5     Steph Junior
Name: Employees, dtype: object

In [8]:
# Append to current DF
my_table['Salary'] = my_table["Salary"].apply(timesThousand)
my_table

  Corporation Employees  Salary
0       Apple      John  200000
1      Google     April  220000
2        Meta       Wes  190000
3       Apple      Beth  130000
4      Google    Justin  120000
5        Meta     Steph  150000

In [9]:
# Multiple columns function
def juicy(x):
    return "Juicy " + x

In [10]:
# Apply to Two Columns
my_table[["Corporation", "Employees"]].apply(juicy)

    Corporation     Employees
0   Juicy Apple    Juicy John
1  Juicy Google   Juicy April
2    Juicy Meta     Juicy Wes
3   Juicy Apple    Juicy Beth
4  Juicy Google  Juicy Justin
5    Juicy Meta   Juicy Steph

In [11]:
# Apply to existing
my_table[["Corporation", "Employees"]] = my_table[["Corporation", "Employees"]].apply(juicy)
my_table

    Corporation     Employees  Salary
0   Juicy Apple    Juicy John  200000
1  Juicy Google   Juicy April  220000
2    Juicy Meta     Juicy Wes  190000
3   Juicy Apple    Juicy Beth  130000
4  Juicy Google  Juicy Justin  120000
5    Juicy Meta   Juicy Steph  150000